#Константы числовые
#d_d - Предельное отклонение
#Предельное отклонение диаметров
d_d_diam = 0.05
#Предельное отклонение длин
d_d_len = 0.105

#Константы текстовые
title_befor = 'до испытаний'
title_after = 'после испытаний'

#Подписи графиков d_0
title_d_0 = f'диаметров образцов {title_befor}'
x_title_d_0 = 'Диаметр d_0, мм'

#Подписи графиков d_k
title_d_k = f'диаметров образцов {title_after}'
x_title_d_k = 'Диаметр d_k, мм'

#Подписи графиков l_0
title_l_0 = f'длин образцов {title_befor}'
x_title_l_0 = 'Длина l_0, мм'

#Подписи графиков l_k
title_l_k = f'длин образцов {title_after}'
x_title_l_k = 'Длина l_k, мм'

#Подписи графиков P_max
title_P_max = 'максимальных усилий разрыва'
x_title_P_max = 'Сила P_max, H'


#Уровень значимости 5 %
alpha = 0.05


#Подписи графиков
title_sigma_b = 'предела прочности'
x_title_sigma_b = 'Предел прочности, МПа'


#Подписи графиков
title_basis_a = ' A-базис'
title_basis_b = ' B-базис'


#Подписи графиков
title_delta = 'относительного удлинения'
x_title_delta = 'Относительное удлинение, %'

#Подписи графиков
title_psi = 'относительного сужения'
x_title_psi = 'Относительное сужение, %'